{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "L": 46,
      "M": 47,
      "N": 48,
      "O": 49,
      "P": 50,
      "R": 51,
      "S": 52,
      "T": 53,
      "U": 54,
      "V": 55,
      "W": 56,
      "X": 57,
      "Y": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "_": 62,
      "a": 63,
      "b": 64,
      "c": 65,
      "d": 66,
      "e": 67,
      "f": 68,
      "g": 69,
      "h": 70,
      "i": 71,
      "j": 72,
      "k": 73,
      "l": 74,
      "m": 75,
      "n": 76,
      "o": 77,
      "p": 78,
      "q": 79,
      "r": 80,
      "s": 81,
      "t": 82,
      "u": 83,
      "v": 84,
      "w": 85,
      "x": 86,
      "y": 87,
      "z": 88,
      "{": 89,
      "}": 90,
      "←": 91,
      "↑": 92,
      "↖": 93,
      "in": 94,
      "int": 95,
      "ar": 96,
      "ma": 97,
      "om": 98,
      "pr": 99,
      "omp": 100,
      "de": 101,
      "te": 102,
      "le": 103,
      "or": 104,
      ");": 105,
      "--": 106,
      "st": 107,
      "ag": 108,
      "for": 109,
      "et": 110,
      "prag": 111,
      "pragma": 112,
      "lo": 113,
      "ou": 114,
      "++": 115,
      "ck": 116,
      "){": 117,
      "00": 118,
      "cl": 119,
      "al": 120,
      "ude": 121,
      "incl": 122,
      "include": 123,
      "lock": 124,
      "oun": 125,
      "coun": 126,
      "var": 127,
      "ur": 128,
      "std": 129,
      "ret": 130,
      "urn": 131,
      "return": 132,
      "arg": 133,
      "----": 134,
      "len": 135,
      "ter": 136,
      "counter": 137,
      "se": 138,
      "it": 139,
      "io": 140,
      "um": 141,
      "countervar": 142,
      "ib": 143,
      "++)": 144,
      "]=": 145,
      "ch": 146,
      "main": 147,
      "(){": 148,
      "intf": 149,
      "printf": 150,
      "(\"": 151,
      "par": 152,
      "];": 153,
      "omp_": 154,
      "lel": 155,
      "allel": 156,
      "stdio": 157,
      "parallel": 158,
      "\",": 159,
      "si": 160,
      "++){": 161,
      "12": 162,
      "100": 163,
      "if": 164,
      "][": 165,
      "19": 166,
      "(&": 167,
      "as": 168,
      "ce": 169,
      "_lock": 170,
      "en": 171,
      "();": 172,
      "//": 173,
      "--------": 174,
      "id": 175,
      "of": 176,
      "re": 177,
      "ad": 178,
      "block": 179,
      "def": 180,
      "])": 181,
      "ze": 182,
      "init": 183,
      "ine": 184,
      "15": 185,
      "16": 186,
      "str": 187,
      "at": 188,
      "num": 189,
      "define": 190,
      "argc": 191,
      "argv": 192,
      "size": 193,
      "ask": 194,
      "am": 195,
      "er": 196,
      "task": 197,
      "ble": 198,
      "ue": 199,
      "sum": 200,
      "13": 201,
      "set": 202,
      "vi": 203,
      "test": 204,
      "oo": 205,
      "th": 206,
      "]);": 207,
      "dou": 208,
      "double": 209,
      "lib": 210,
      "stdlib": 211,
      "ed": 212,
      "targ": 213,
      "target": 214,
      "ss": 215,
      "team": 216,
      "teams": 217,
      "di": 218,
      "tr": 219,
      "set_lock": 220,
      "mp": 221,
      "==": 222,
      "on": 223,
      "count": 224,
      "char": 225,
      "ic": 226,
      "map": 227,
      "()": 228,
      "rom": 229,
      "[])": 230,
      "99": 231,
      "ute": 232,
      "++;": 233,
      "ibute": 234,
      "ng": 235,
      "ra": 236,
      "num_": 237,
      "tid": 238,
      "ool": 239,
      "devi": 240,
      "long": 241,
      "add": 242,
      "stribute": 243,
      "distribute": 244,
      "device": 245,
      "ate": 246,
      "bool": 247,
      "sh": 248,
      "tof": 249,
      "tofrom": 250,
      "=%": 251,
      "eck": 252,
      "fal": 253,
      "out": 254,
      "check": 255,
      "----------------": 256,
      "read": 257,
      "true": 258,
      "false": 259,
      "su": 260,
      "]=%": 261,
      "loc": 262,
      "end": 263,
      "sim": 264,
      "65": 265,
      "]+": 266,
      "ing": 267,
      "un": 268,
      "addlock": 269,
      "sublock": 270,
      "],": 271,
      "ri": 272,
      "ct": 273,
      "oid": 274,
      "void": 275,
      "ion": 276,
      "cr": 277,
      "xa": 278,
      "18": 279,
      "ait": 280,
      "el": 281,
      "wait": 282,
      "ared": 283,
      "simd": 284,
      "\");": 285,
      "val": 286,
      "1000": 287,
      "thread": 288,
      "shared": 289,
      "10": 290,
      "200": 291,
      "ul": 292,
      "temp": 293,
      "20": 294,
      "50": 295,
      "55": 296,
      "nd": 297,
      "itic": 298,
      "omp_un": 299,
      "critic": 300,
      "critical": 301,
      "ase": 302,
      "lloc": 303,
      "pend": 304,
      "depend": 305,
      "omp_set_lock": 306,
      "the": 307,
      "omp_unset_lock": 308,
      "*/": 309,
      "/*": 310,
      "ser": 311,
      "!=": 312,
      "63": 313,
      "max": 314,
      "ction": 315,
      "else": 316,
      "sert": 317,
      "52": 318,
      "_block": 319,
      "_size": 320,
      "bar": 321,
      "tmp": 322,
      "malloc": 323,
      "cess": 324,
      "rier": 325,
      "_block_size": 326,
      "barrier": 327,
      "57": 328,
      "85": 329,
      "89": 330,
      "]!=": 331,
      "base": 332,
      "iv": 333,
      "10000": 334,
      "ent": 335,
      "));": 336,
      "_t": 337,
      "ccess": 338,
      "inde": 339,
      "taskwait": 340,
      "index": 341,
      "il": 342,
      "oi": 343,
      "oy": 344,
      "to": 345,
      "destr": 346,
      "stdbool": 347,
      "assert": 348,
      "atoi": 349,
      "sizeof": 350,
      "destroy": 351,
      "->": 352,
      "61": 353,
      "<=": 354,
      "Access": 355,
      "Iss": 356,
      "Me": 357,
      "mor": 358,
      "pa": 359,
      "sib": 360,
      "ut": 361,
      "priv": 362,
      "visib": 363,
      "Issue": 364,
      "Memor": 365,
      "private": 366,
      "visible": 367,
      "Memory": 368,
      "60": 369,
      "ment": 370,
      "arra": 371,
      "omp_init": 372,
      "omp_destroy": 373,
      "190": 374,
      "blocks": 375,
      "164": 376,
      "130": 377,
      "100000": 378,
      "array": 379,
      "put": 380,
      "section": 381,
      "omp_init_lock": 382,
      "omp_destroy_lock": 383,
      "33": 384,
      "au": 385,
      "cor": 386,
      "con": 387,
      "fre": 388,
      "foo": 389,
      "(\"%": 390,
      "--------------------------------": 391,
      "free": 392,
      "ir": 393,
      "sing": 394,
      "xa1": 395,
      "xa2": 396,
      "ult": 397,
      "core": 398,
      "25": 399,
      "27": 400,
      "29": 401,
      "67": 402,
      "69": 403,
      "81": 404,
      "83": 405,
      "94": 406,
      "bp": 407,
      "is": 408,
      "l0": 409,
      "l1": 410,
      "pe": 411,
      "pro": 412,
      "ted": 413,
      "lement": 414,
      "lock_t": 415,
      "omp_lock_t": 416,
      "120": 417,
      "159": 418,
      "ata": 419,
      "one": 420,
      "187": 421,
      "-=": 422,
      "31": 423,
      "500": 424,
      "71": 425,
      "mat": 426,
      "threads": 427,
      "**": 428,
      "64": 429,
      "Score": 430,
      "fl": 431,
      "im": 432,
      "ched": 433,
      "race": 434,
      "num_threads": 435,
      "match": 436,
      "((": 437,
      "+=": 438,
      "11": 439,
      "Len": 440,
      "cted": 441,
      "u1": 442,
      "inout": 443,
      "are": 444,
      "alc": 445,
      "idx": 446,
      "num_teams": 447,
      "barrier_": 448,
      "..": 449,
      "35": 450,
      "37": 451,
      "39": 452,
      "87": 453,
      "No": 454,
      "Set": 455,
      "Th": 456,
      "]++;": 457,
      "ex": 458,
      "iss": 459,
      "no": 460,
      "decl": 461,
      "125": 462,
      "127": 463,
      "1285": 464,
      "195": 465,
      "197": 466,
      "154": 467,
      "sum1": 468,
      "999": 469,
      "indexSet": 470,
      "pair": 471,
      "single": 472,
      "pected": 473,
      "declare": 474,
      "es": 475,
      "flo": 476,
      "os": 477,
      "input": 478,
      "stat": 479,
      "]+=": 480,
      "521": 481,
      "expected": 482,
      "float": 483,
      "static": 484,
      "*)": 485,
      "23": 486,
      "512": 487,
      "[%": 488,
      "by": 489,
      "ber": 490,
      "element": 491,
      "ial": 492,
      "lck": 493,
      "ror": 494,
      "sched": 495,
      "vs": 496,
      "des": 497,
      "numNo": 498,
      "sum0": 499,
      "diag": 500,
      "prod": 501,
      "numNodes": 502,
      "].": 503,
      "_M": 504,
      "ap": 505,
      "data": 506,
      "done": 507,
      "fib": 508,
      "hi": 509,
      "ize": 510,
      "l2": 511,
      "sa": 512,
      "u2": 513,
      "ush": 514,
      "whi": 515,
      "x_block_size": 516,
      "y_block_size": 517,
      "inLen": 518,
      "rand": 519,
      "thread_": 520,
      "2000": 521,
      "2013": 522,
      "ild": 523,
      "flush": 524,
      "';": 525,
      "17": 526,
      "1st": 527,
      "21": 528,
      "2nd": 529,
      "49": 530,
      "73": 531,
      "ault": 532,
      "be": 533,
      "calc": 534,
      "f1": 535,
      "fflush": 536,
      "get": 537,
      "ig": 538,
      "sj": 539,
      "ste": 540,
      "ve": 541,
      "ckag": 542,
      "stdout": 543,
      "omp_get": 544,
      "initial": 545,
      "ates": 546,
      "output": 547,
      "packag": 548,
      "sections": 549,
      "aux": 550,
      "ause": 551,
      "matchScore": 552,
      "Thread": 553,
      "while": 554,
      "omp_get_": 555,
      ")*": 556,
      "Data": 557,
      "from": 558,
      "min": 559,
      "miss": 560,
      "nE": 561,
      "ph": 562,
      "uce": 563,
      "uct": 564,
      "z_block_size": 565,
      "};": 566,
      "arit": 567,
      "vars": 568,
      "child": 569,
      "ener": 570,
      "ref": 571,
      "default": 572,
      "struct": 573,
      "number": 574,
      "num_vars": 575,
      "rite": 576,
      "ilarit": 577,
      "ime": 578,
      "ilarity": 579,
      "-%": 580,
      "42000": 581,
      "533": 582,
      "Di": 583,
      "End": 584,
      "Pos": 585,
      "_set": 586,
      "_num_": 587,
      "able": 588,
      "and": 589,
      "cap": 590,
      "cause": 591,
      "ne": 592,
      "nam": 593,
      "op": 594,
      "pcounter": 595,
      "time": 596,
      "ule": 597,
      "may": 598,
      "--;": 599,
      "alloc": 600,
      "error": 601,
      "onal": 602,
      "add_M": 603,
      "similarity": 604,
      "/*--------------------------------": 605,
      "maxPos": 606,
      "max_num_": 607,
      "------------------------------------": 608,
      "...": 609,
      "schedule": 610,
      "diagonal": 611,
      "numNodes2": 612,
      "thread_num": 613,
      "initialize": 614,
      "packages": 615,
      "omp_get_thread_num": 616,
      "add_Mult": 617,
      "/*--------------------------------------------------------------------": 618,
      "max_num_blocks": 619,
      ")/": 620,
      "48": 621,
      "911": 622,
      "::": 623,
      "Calc": 624,
      "Miss": 625,
      "ON": 626,
      "]*": 627,
      "ack": 628,
      "dy": 629,
      "elen": 630,
      "ft": 631,
      "felen": 632,
      "gener": 633,
      "jb": 634,
      "kb": 635,
      "mo": 636,
      "my": 637,
      "nprod": 638,
      "ps": 639,
      "psum": 640,
      "up": 641,
      "incr": 642,
      "art": 643,
      "omic": 644,
      "pred": 645,
      "left": 646,
      "--){": 647,
      "st_lock": 648,
      "ag_t": 649,
      "low": 650,
      "seg": 651,
      "ence": 652,
      "res": 653,
      "ation": 654,
      "atomic": 655,
      "erence": 656,
      "local": 657,
      "value": 658,
      "20000": 659,
      "consum": 660,
      "irst": 661,
      "flag_t": 662,
      "barrier_wait": 663,
      "not": 664,
      "produce": 665,
      "safelen": 666,
      "Diag": 667,
      "nest_lock": 668,
      "namic": 669,
      "Calcul": 670,
      "dynamic": 671,
      "generate": 672,
      "mybarrier": 673,
      "incr_": 674,
      "(*": 675,
      "119": 676,
      "1197": 677,
      "47": 678,
      "599": 679,
      "581": 680,
      "583": 681,
      "549": 682,
      "547": 683,
      "661": 684,
      "625": 685,
      "627": 686,
      "629": 687,
      "75": 688,
      "865": 689,
      "863": 690,
      "885": 691,
      "889": 692,
      "861": 693,
      "867": 694,
      "869": 695,
      "887": 696,
      "919": 697,
      "915": 698,
      "913": 699,
      "965": 700,
      "963": 701,
      "989": 702,
      "967": 703,
      "969": 704,
      "971": 705,
      "937": 706,
      "939": 707,
      "917": 708,
      "921": 709,
      "973": 710,
      "<<": 711,
      "Ab": 712,
      "Done": 713,
      "Er": 714,
      "GA": 715,
      "Get": 716,
      "Re": 717,
      "TT": 718,
      "Write": 719,
      "]@": 720,
      "_nest_lock": 721,
      "ab": 722,
      "ai": 723,
      "aj": 724,
      "ev": 725,
      "f0": 726,
      "ger": 727,
      "i2": 728,
      "ix": 729,
      "iable": 730,
      "j2": 731,
      "k2": 732,
      "ld": 733,
      "nthread": 734,
      "nste": 735,
      "py": 736,
      "sz": 737,
      "ty": 738,
      "tou": 739,
      "ting": 740,
      "using": 741,
      "x1": 742,
      "xpy": 743,
      "matr": 744,
      "orting": 745,
      "start": 746,
      "loop": 747,
      "++,": 748,
      "ith": 749,
      "(\"\\": 750,
      "1255": 751,
      "1257": 752,
      "1233": 753,
      "1225": 754,
      "1227": 755,
      "1229": 756,
      "1281": 757,
      "1283": 758,
      "1231": 759,
      "1223": 760,
      "1249": 761,
      "1955": 762,
      "1957": 763,
      "1985": 764,
      "1961": 765,
      "1933": 766,
      "1925": 767,
      "1927": 768,
      "1929": 769,
      "1981": 770,
      "1983": 771,
      "1931": 772,
      "1935": 773,
      "1987": 774,
      "red": 775,
      "remo": 776,
      "1565": 777,
      "1563": 778,
      "1589": 779,
      "1561": 780,
      "1567": 781,
      "1569": 782,
      "1571": 783,
      "1535": 784,
      "1537": 785,
      "1539": 786,
      "1587": 787,
      "1619": 788,
      "1615": 789,
      "1613": 790,
      "1665": 791,
      "1667": 792,
      "1669": 793,
      "1671": 794,
      "1639": 795,
      "1623": 796,
      "1617": 797,
      "1621": 798,
      "1673": 799,
      "1675": 800,
      "numThread": 801,
      "1333": 802,
      "1327": 803,
      "1329": 804,
      "1331": 805,
      "1311": 806,
      "1335": 807,
      "1337": 808,
      "trig": 809,
      "().": 810,
      "991": 811,
      "993": 812,
      "995": 813,
      "997": 814,
      "num_sz": 815,
      "outLen": 816,
      "651": 817,
      "653": 818,
      "655": 819,
      "657": 820,
      "659": 821,
      "unction": 822,
      "180": 823,
      "1899": 824,
      "1881": 825,
      "1883": 826,
      "2003": 827,
      "2005": 828,
      "2007": 829,
      "2009": 830,
      "uling": 831,
      "2025": 832,
      "2011": 833,
      "551": 834,
      "553": 835,
      "555": 836,
      "557": 837,
      "631": 838,
      "633": 839,
      "635": 840,
      "525": 841,
      "529": 842,
      "573": 843,
      "575": 844,
      "577": 845,
      "579": 846,
      "859": 847,
      "891": 848,
      "893": 849,
      "895": 850,
      "]!=-": 851,
      "601": 852,
      "603": 853,
      "605": 854,
      "607": 855,
      "609": 856,
      "ments": 857,
      "1901": 858,
      "1903": 859,
      "1905": 860,
      "1907": 861,
      "1909": 862,
      "1641": 863,
      "1643": 864,
      "1645": 865,
      "1647": 866,
      "1649": 867,
      "1301": 868,
      "1303": 869,
      "1305": 870,
      "1307": 871,
      "1309": 872,
      "construct": 873,
      "941": 874,
      "943": 875,
      "945": 876,
      "947": 877,
      "pedef": 878,
      "1201": 879,
      "1203": 880,
      "1205": 881,
      "1207": 882,
      "1591": 883,
      "1593": 884,
      "1595": 885,
      "1597": 886,
      "1873": 887,
      "1875": 888,
      "1877": 889,
      "1879": 890,
      "matchMiss": 891,
      "This": 892,
      "nowait": 893,
      "1251": 894,
      "1253": 895,
      "1259": 896,
      "1275": 897,
      "1277": 898,
      "1279": 899,
      "1951": 900,
      "1953": 901,
      "1959": 902,
      "1977": 903,
      "1979": 904,
      "1541": 905,
      "1543": 906,
      "1545": 907,
      "elements": 908,
      "scheduling": 909,
      "saxpy": 910,
      "missing": 911,
      "nEle": 912,
      "phase": 913,
      "reference": 914,
      "allocate": 915,
      "...\\": 916,
      "segments": 917,
      "1199": 918,
      "Aborting": 919,
      "Error": 920,
      "Write_set": 921,
      "even": 922,
      "nsteps": 923,
      "typedef": 924,
      "touched": 925,
      "matrix": 926,
      "numThreads": 927,
      "trigger": 928,
      "matchMissmatchScore": 929,
      "(!": 930,
      "))": 931,
      "531": 932,
      "70": 933,
      "AN": 934,
      "AX": 935,
      "Alloc": 936,
      "Con": 937,
      "De": 938,
      "D_M": 939,
      "Element": 940,
      "Function": 941,
      "In": 942,
      "LL": 943,
      "NU": 944,
      "Num": 945,
      "NON": 946,
      "Pr": 947,
      "Pur": 948,
      "RAN": 949,
      "Un": 950,
      "]-=": 951,
      "an": 952,
      "ach": 953,
      "boun": 954,
      "cil": 955,
      "first": 956,
      "gn": 957,
      "gr": 958,
      "gap": 959,
      "ha": 960,
      "i1": 961,
      "ise": 962,
      "j1": 963,
      "k1": 964,
      "lt": 965,
      "lim": 966,
      "ncon": 967,
      "nDiag": 968,
      "ncil": 969,
      "ose": 970,
      "pos": 971,
      "pose": 972,
      "r1": 973,
      "ster": 974,
      "tter": 975,
      "ver": 976,
      "we": 977,
      "wor": 978,
      "write": 979,
      "with": 980,
      "inal": 981,
      "insert": 982,
      "master": 983,
      "pre": 984,
      "letter": 985,
      "orig": 986,
      "variable": 987,
      "ition": 988,
      "]=((": 989,
      "parent": 990,
      "sign": 991,
      "resu": 992,
      "ines": 993,
      "string": 994,
      "tribute": 995,
      "raise": 996,
      "unsign": 997,
      "threadprivate": 998,
      "1048": 999,
      "ulation": 1000,
      "523": 1001,
      "527": 1002,
      "based": 1003,
      "const": 1004,
      "contribute": 1005,
      "progr": 1006,
      "races": 1007,
      "pairs": 1008,
      "thread_lim": 1009,
      "calculation": 1010,
      "stencil": 1011,
      "nElement": 1012,
      "refine": 1013,
      "similarityScore": 1014,
      "lower": 1015,
      "values": 1016,
      "Calculate": 1017,
      "incr_b": 1018,
      "remove": 1019,
      "Allocates": 1020,
      "D_MAX": 1021,
      "NULL": 1022,
      "Number": 1023,
      "NONE": 1024,
      "Pro": 1025,
      "Purpose": 1026,
      "RAND_MAX": 1027,
      "Univ": 1028,
      "bound": 1029,
      "gapScore": 1030,
      "ncons": 1031,
      "position": 1032,
      "work": 1033,
      "original": 1034,
      "result": 1035,
      "unsigned": 1036,
      "contributed": 1037,
      "program": 1038,
      "thread_limit": 1039,
      "stencil_": 1040,
      "',": 1041,
      "'←": 1042,
      "'↑": 1043,
      "(%": 1044,
      "(+": 1045,
      "(-": 1046,
      "):": 1047,
      "*));": 1048,
      "14": 1049,
      "2l": 1050,
      "40": 1051,
      "56": 1052,
      "62": 1053,
      "66": 1054,
      "923": 1055,
      ">-": 1056,
      "AG": 1057,
      "AL": 1058,
      "ATT": 1059,
      "BU": 1060,
      "Be": 1061,
      "Bool": 1062,
      "CA": 1063,
      "Ch": 1064,
      "CTT": 1065,
      "DE": 1066,
      "DI": 1067,
      "EF": 1068,
      "Fib": 1069,
      "First": 1070,
      "Gu": 1071,
      "Gener": 1072,
      "Hel": 1073,
      "LEF": 1074,
      "Mat": 1075,
      "Mult": 1076,
      "Ra": 1077,
      "Ri": 1078,
      "St": 1079,
      "Size": 1080,
      "TH": 1081,
      "Task": 1082,
      "UP": 1083,
      "Yi": 1084,
      "]<=": 1085,
      "_input": 1086,
      "_from": 1087,
      "_Bool": 1088,
      "ac": 1089,
      "af": 1090,
      "ang": 1091,
      "access": 1092,
      "bal": 1093,
      "back": 1094,
      "comp": 1095,
      "cre": 1096,
      "calloc": 1097,
      "dri": 1098,
      "duce": 1099,
      "fines": 1100,
      "ist": 1101,
      "ke": 1102,
      "lld": 1103,
      "ol": 1104,
      "per": 1105,
      "rd": 1106,
      "ros": 1107,
      "score": 1108,
      "srand": 1109,
      "ts": 1110,
      "use": 1111,
      "uction": 1112,
      "vel": 1113,
      "wo": 1114,
      "wil": 1115,
      "zi": 1116,
      "{}": 1117,
      "math": 1118,
      "decess": 1119,
      "dered": 1120,
      "deallocate": 1121,
      "level": 1122,
      "orag": 1123,
      "ordered": 1124,
      "stop": 1125,
      "storag": 1126,
      "load": 1127,
      "lobal": 1128,
      "ould": 1129,
      "++]": 1130,
      "clause": 1131,
      "allow": 1132,
      "ure": 1133,
      "seed": 1134,
      "itial": 1135,
      "chang": 1136,
      "omp_set": 1137,
      "1001": 1138,
      "ass": 1139,
      "asing": 1140,
      "ens": 1141,
      "//#": 1142,
      "rect": 1143,
      "ad_set": 1144,
      "zeros": 1145,
      "thrd": 1146,
      "track": 1147,
      "===": 1148,
      "num_refine": 1149,
      "should": 1150,
      "rix": 1151,
      "2048": 1152,
      "there": 1153,
      "maxim": 1154,
      "prote": 1155,
      "**)": 1156,
      "barrier_init": 1157,
      "barrier_destroy": 1158,
      "barrier_start": 1159,
      "barrier_stop": 1160,
      "Note": 1161,
      "now": 1162,
      "ested": 1163,
      "calcFirst": 1164,
      "package": 1165,
      "missmatchScore": 1166,
      "phab": 1167,
      "ONAL": 1168,
      "consume": 1169,
      "consumed": 1170,
      "produced": 1171,
      "DiagElement": 1172,
      "Calculates": 1173,
      "incr_a": 1174,
      "GAATT": 1175,
      "GACTT": 1176,
      "Read_set": 1177,
      "reduction": 1178,
      "Consum": 1179,
      "Defines": 1180,
      "Initial": 1181,
      "ants": 1182,
      "firstprivate": 1183,
      "have": 1184,
      "within": 1185,
      "predecess": 1186,
      "Produce": 1187,
      "stencil_calc": 1188,
      "'←'": 1189,
      "'↑'": 1190,
      "(+:": 1191,
      "2lf": 1192,
      "AGONAL": 1193,
      "BUG": 1194,
      "Because": 1195,
      "Child": 1196,
      "DEBUG": 1197,
      "DIAGONAL": 1198,
      "Generates": 1199,
      "Helper": 1200,
      "LEFT": 1201,
      "Matrix": 1202,
      "Race": 1203,
      "Rice": 1204,
      "Yizi": 1205,
      "_from_input": 1206,
      "after": 1207,
      "backtrack": 1208,
      "creasing": 1209,
      "driver": 1210,
      "will": 1211,
      "storage": 1212,
      "load_from_input": 1213,
      "change": 1214,
      "maximum": 1215,
      "calcFirstDiagElement": 1216,
      "phabet": 1217,
      "GAATTCA": 1218,
      "predecessor": 1219,
      "Helpers": 1220,
      "\"<<": 1221,
      "&&": 1222,
      ")-": 1223,
      ").": 1224,
      ")\\": 1225,
      ")++;": 1226,
      ")=%": 1227,
      "0f": 1228,
      "26": 1229,
      "34": 1230,
      "96": 1231,
      "97": 1232,
      ";}": 1233,
      ">=": 1234,
      "Al": 1235,
      "An": 1236,
      "Aach": 1237,
      "ATH": 1238,
      "Cl": 1239,
      "Col": 1240,
      "Del": 1241,
      "Ex": 1242,
      "Gen": 1243,
      "Global": 1244,
      "Jo": 1245,
      "Lines": 1246,
      "M_": 1247,
      "PI": 1248,
      "Pre": 1249,
      "PATH": 1250,
      "RW": 1251,
      "Rand": 1252,
      "Si": 1253,
      "Ste": 1254,
      "Sum": 1255,
      "Str": 1256,
      "Sim": 1257,
      "Sig": 1258,
      "Time": 1259,
      "Two": 1260,
      "Up": 1261,
      "Var": 1262,
      "We": 1263,
      "Wu": 1264,
      "Wen": 1265,
      "With": 1266,
      "[*": 1267,
      "[]": 1268,
      "]\\": 1269,
      "]};": 1270,
      "_c": 1271,
      "_l": 1272,
      "_n": 1273,
      "_s": 1274,
      "_pro": 1275,
      "aw": 1276,
      "ain": 1277,
      "ail": 1278,
      "ake": 1279,
      "bl": 1280,
      "bt": 1281,
      "but": 1282,
      "ci": 1283,
      "cout": 1284,
      "cassert": 1285,
      "cau": 1286,
      "dat": 1287,
      "date": 1288,
      "dates": 1289,
      "eg": 1290,
      "esh": 1291,
      "eable": 1292,
      "each": 1293,
      "fprintf": 1294,
      "fault": 1295,
      "ference": 1296,
      "function": 1297,
      "fail": 1298,
      "gg": 1299,
      "gone": 1300,
      "global": 1301,
      "geable": 1302,
      "ip": 1303,
      "istd": 1304,
      "ire": 1305,
      "ike": 1306,
      "ly": 1307,
      "line": 1308,
      "lab": 1309,
      "like": 1310,
      "mine": 1311,
      "mer": 1312,
      "mult": 1313,
      "mist": 1314,
      "mens": 1315,
      "mesh": 1316,
      "ns": 1317,
      "nt": 1318,
      "none": 1319,
      "nMatrix": 1320,
      "ove": 1321,
      "over": 1322,
      "obt": 1323,
      "pu": 1324,
      "pat": 1325,
      "pass": 1326,
      "qu": 1327,
      "q_c": 1328,
      "rr": 1329,
      "ron": 1330,
      "sb": 1331,
      "sf": 1332,
      "sm": 1333,
      "sw": 1334,
      "som": 1335,
      "sam": 1336,
      "tze": 1337,
      "two": 1338,
      "ving": 1339,
      "wtime": 1340,
      "w_pro": 1341,
      "wron": 1342,
      "{&": 1343,
      "{};": 1344,
      "inste": 1345,
      "increasing": 1346,
      "decreasing": 1347,
      "derr": 1348,
      "orted": 1349,
      "ores": 1350,
      "stre": 1351,
      "stable": 1352,
      "stack": 1353,
      "stants": 1354,
      "stderr": 1355,
      "class": 1356,
      "alread": 1357,
      "alphabet": 1358,
      "argum": 1359,
      "tern": 1360,
      "termine": 1361,
      "sent": 1362,
      "seq_c": 1363,
      "iostre": 1364,
      "umns": 1365,
      "omp_nest_lock": 1366,
      "sic": 1367,
      "ifdef": 1368,
      "][%": 1369,
      "aset": 1370,
      "assic": 1371,
      "])/": 1372,
      "taskloop": 1373,
      "set_nest_lock": 1374,
      "oops": 1375,
      "dir": 1376,
      "dimens": 1377,
      "onac": 1378,
      "()%": 1379,
      "()==": 1380,
      "())/": 1381,
      "add_s": 1382,
      "sugg": 1383,
      "location": 1384,
      "endl": 1385,
      "endif": 1386,
      "simul": 1387,
      "ings": 1388,
      "unistd": 1389,
      "ional": 1390,
      "valid": 1391,
      "2015": 1392,
      "omp_unset_nest_lock": 1393,
      "serve": 1394,
      "serts": 1395,
      "_tol": 1396,
      "indexing": 1397,
      "tol": 1398,
      "tomat": 1399,
      "pace": 1400,
      "utation": 1401,
      "omp_init_nest_lock": 1402,
      "omp_destroy_nest_lock": 1403,
      "arrays": 1404,
      "automat": 1405,
      "correct": 1406,
      "ones": 1407,
      "**));": 1408,
      "****": 1409,
      "***)": 1410,
      "***));": 1411,
      "****)": 1412,
      "(((": 1413,
      "exit": 1414,
      "node": 1415,
      "espace": 1416,
      "which": 1417,
      "because": 1418,
      "calcElement": 1419,
      "initialTime": 1420,
      "omp_get_num_threads": 1421,
      "omp_get_wtime": 1422,
      "missmatch": 1423,
      "phen": 1424,
      "structure": 1425,
      "Direct": 1426,
      "new_pro": 1427,
      "namespace": 1428,
      "error_tol": 1429,
      "Missing": 1430,
      "]*=": 1431,
      "move": 1432,
      "update": 1433,
      "consumer": 1434,
      "producer": 1435,
      "<<\"": 1436,
      "Gets": 1437,
      "Real": 1438,
      "Reference": 1439,
      "above": 1440,
      "iables": 1441,
      "loops": 1442,
      "removing": 1443,
      "matrixes": 1444,
      "Constants": 1445,
      "Determine": 1446,
      "Inserts": 1447,
      "answ": 1448,
      "achim": 1449,
      "hao": 1450,
      "preserve": 1451,
      "variables": 1452,
      "strings": 1453,
      "constants": 1454,
      "Protze": 1455,
      "stencil_in": 1456,
      "4096": 1457,
      "Fibonac": 1458,
      "Start": 1459,
      "Stores": 1460,
      "acqu": 1461,
      "compared": 1462,
      "computation": 1463,
      "scores": 1464,
      "used": 1465,
      "allows": 1466,
      "omp_set_nest_lock": 1467,
      "omp_set_n": 1468,
      "ensure": 1469,
      "protection": 1470,
      "protected": 1471,
      "Consumer": 1472,
      "Consumed": 1473,
      "Initialize": 1474,
      "Produced": 1475,
      "Producer": 1476,
      "Alphabet": 1477,
      "Any": 1478,
      "Aachen": 1479,
      "Classic": 1480,
      "Columns": 1481,
      "Delaw": 1482,
      "Expected": 1483,
      "Joachim": 1484,
      "M_PI": 1485,
      "Present": 1486,
      "RWTH": 1487,
      "Random": 1488,
      "Sieg": 1489,
      "Stephen": 1490,
      "Strings": 1491,
      "Similarity": 1492,
      "Sigma": 1493,
      "Updates": 1494,
      "Variables": 1495,
      "Wenhao": 1496,
      "Without": 1497,
      "_list": 1498,
      "blic": 1499,
      "causing": 1500,
      "dataset": 1501,
      "fails": 1502,
      "iple": 1503,
      "linear": 1504,
      "labs": 1505,
      "mergeable": 1506,
      "multiple": 1507,
      "mistake": 1508,
      "obtain": 1509,
      "public": 1510,
      "pattern": 1511,
      "some": 1512,
      "same": 1513,
      "wrong": 1514,
      "instead": 1515,
      "orted_list": 1516,
      "already": 1517,
      "argument": 1518,
      "seq_cst": 1519,
      "iostream": 1520,
      "omp_nest_lock_t": 1521,
      "dimensional": 1522,
      "())/((": 1523,
      "add_sorted_list": 1524,
      "suggested": 1525,
      "simulate": 1526,
      "automatic": 1527,
      "Directly": 1528,
      "new_proc": 1529,
      "References": 1530,
      "answer": 1531,
      "Fibonacci": 1532,
      "acquire": 1533,
      "omp_set_nested": 1534,
      "Delaware": 1535,
      "Siegel": 1536
    },
    "merges": [
      "i n",
      "in t",
      "a r",
      "m a",
      "o m",
      "p r",
      "om p",
      "d e",
      "t e",
      "l e",
      "o r",
      ") ;",
      "- -",
      "s t",
      "a g",
      "f or",
      "e t",
      "pr ag",
      "prag ma",
      "l o",
      "o u",
      "+ +",
      "c k",
      ") {",
      "0 0",
      "c l",
      "a l",
      "u de",
      "in cl",
      "incl ude",
      "lo ck",
      "ou n",
      "c oun",
      "v ar",
      "u r",
      "st d",
      "r et",
      "ur n",
      "ret urn",
      "ar g",
      "-- --",
      "le n",
      "te r",
      "coun ter",
      "s e",
      "i t",
      "i o",
      "u m",
      "counter var",
      "i b",
      "++ )",
      "] =",
      "c h",
      "ma in",
      "( ){",
      "int f",
      "pr intf",
      "( \"",
      "p ar",
      "] ;",
      "omp _",
      "le l",
      "al lel",
      "std io",
      "par allel",
      "\" ,",
      "s i",
      "++ ){",
      "1 2",
      "1 00",
      "i f",
      "] [",
      "1 9",
      "( &",
      "a s",
      "c e",
      "_ lock",
      "e n",
      "( );",
      "/ /",
      "---- ----",
      "i d",
      "o f",
      "r e",
      "a d",
      "b lock",
      "de f",
      "] )",
      "z e",
      "in it",
      "in e",
      "1 5",
      "1 6",
      "st r",
      "a t",
      "n um",
      "def ine",
      "arg c",
      "arg v",
      "si ze",
      "as k",
      "a m",
      "e r",
      "t ask",
      "b le",
      "u e",
      "s um",
      "1 3",
      "s et",
      "v i",
      "te st",
      "o o",
      "t h",
      "] );",
      "d ou",
      "dou ble",
      "l ib",
      "std lib",
      "e d",
      "t arg",
      "targ et",
      "s s",
      "te am",
      "team s",
      "d i",
      "t r",
      "set _lock",
      "m p",
      "= =",
      "o n",
      "coun t",
      "ch ar",
      "i c",
      "ma p",
      "( )",
      "r om",
      "[ ])",
      "9 9",
      "u te",
      "++ ;",
      "ib ute",
      "n g",
      "r a",
      "num _",
      "t id",
      "oo l",
      "de vi",
      "lo ng",
      "ad d",
      "str ibute",
      "di stribute",
      "devi ce",
      "a te",
      "b ool",
      "s h",
      "t of",
      "tof rom",
      "= %",
      "e ck",
      "f al",
      "ou t",
      "ch eck",
      "-------- --------",
      "re ad",
      "tr ue",
      "fal se",
      "s u",
      "]= %",
      "lo c",
      "en d",
      "si m",
      "6 5",
      "] +",
      "in g",
      "u n",
      "add lock",
      "su block",
      "] ,",
      "r i",
      "c t",
      "o id",
      "v oid",
      "io n",
      "c r",
      "x a",
      "1 8",
      "a it",
      "e l",
      "w ait",
      "ar ed",
      "sim d",
      "\" );",
      "v al",
      "100 0",
      "th read",
      "sh ared",
      "1 0",
      "2 00",
      "u l",
      "te mp",
      "2 0",
      "5 0",
      "5 5",
      "n d",
      "it ic",
      "omp_ un",
      "cr itic",
      "critic al",
      "a se",
      "l loc",
      "p end",
      "de pend",
      "omp_ set_lock",
      "th e",
      "omp_un set_lock",
      "* /",
      "/ *",
      "se r",
      "! =",
      "6 3",
      "ma x",
      "ct ion",
      "el se",
      "ser t",
      "5 2",
      "_ block",
      "_ size",
      "b ar",
      "t mp",
      "ma lloc",
      "ce ss",
      "ri er",
      "_block _size",
      "bar rier",
      "5 7",
      "8 5",
      "8 9",
      "] !=",
      "b ase",
      "i v",
      "100 00",
      "en t",
      ") );",
      "_ t",
      "c cess",
      "in de",
      "task wait",
      "inde x",
      "i l",
      "o i",
      "o y",
      "t o",
      "de str",
      "std bool",
      "as sert",
      "at oi",
      "size of",
      "destr oy",
      "- >",
      "6 1",
      "< =",
      "A ccess",
      "I ss",
      "M e",
      "m or",
      "p a",
      "s ib",
      "u t",
      "pr iv",
      "vi sib",
      "Iss ue",
      "Me mor",
      "priv ate",
      "visib le",
      "Memor y",
      "6 0",
      "m ent",
      "ar ra",
      "omp_ init",
      "omp_ destroy",
      "19 0",
      "block s",
      "16 4",
      "13 0",
      "10000 0",
      "arra y",
      "p ut",
      "se ction",
      "omp_init _lock",
      "omp_destroy _lock",
      "3 3",
      "a u",
      "c or",
      "c on",
      "f re",
      "f oo",
      "(\" %",
      "---------------- ----------------",
      "fre e",
      "i r",
      "s ing",
      "xa 1",
      "xa 2",
      "ul t",
      "cor e",
      "2 5",
      "2 7",
      "2 9",
      "6 7",
      "6 9",
      "8 1",
      "8 3",
      "9 4",
      "b p",
      "i s",
      "l 0",
      "l 1",
      "p e",
      "pr o",
      "te d",
      "le ment",
      "lock _t",
      "omp_ lock_t",
      "12 0",
      "15 9",
      "at a",
      "on e",
      "18 7",
      "- =",
      "3 1",
      "5 00",
      "7 1",
      "ma t",
      "thread s",
      "* *",
      "6 4",
      "S core",
      "f l",
      "i m",
      "ch ed",
      "ra ce",
      "num_ threads",
      "mat ch",
      "( (",
      "+ =",
      "1 1",
      "L en",
      "c ted",
      "u 1",
      "in out",
      "ar e",
      "al c",
      "id x",
      "num_ teams",
      "barrier _",
      ". .",
      "3 5",
      "3 7",
      "3 9",
      "8 7",
      "N o",
      "S et",
      "T h",
      "] ++;",
      "e x",
      "i ss",
      "n o",
      "de cl",
      "12 5",
      "12 7",
      "12 85",
      "19 5",
      "19 7",
      "15 4",
      "sum 1",
      "99 9",
      "index Set",
      "pa ir",
      "sing le",
      "pe cted",
      "decl are",
      "e s",
      "f lo",
      "o s",
      "in put",
      "st at",
      "]+ =",
      "52 1",
      "ex pected",
      "flo at",
      "stat ic",
      "* )",
      "2 3",
      "5 12",
      "[ %",
      "b y",
      "b er",
      "e lement",
      "i al",
      "l ck",
      "r or",
      "s ched",
      "v s",
      "de s",
      "num No",
      "sum 0",
      "di ag",
      "pro d",
      "numNo des",
      "] .",
      "_ M",
      "a p",
      "d ata",
      "d one",
      "f ib",
      "h i",
      "i ze",
      "l 2",
      "s a",
      "u 2",
      "u sh",
      "w hi",
      "x _block_size",
      "y _block_size",
      "in Len",
      "ra nd",
      "thread _",
      "200 0",
      "20 13",
      "il d",
      "fl ush",
      "' ;",
      "1 7",
      "1 st",
      "2 1",
      "2 nd",
      "4 9",
      "7 3",
      "a ult",
      "b e",
      "c alc",
      "f 1",
      "f flush",
      "g et",
      "i g",
      "s j",
      "s te",
      "v e",
      "ck ag",
      "std out",
      "omp_ get",
      "init ial",
      "ate s",
      "out put",
      "pa ckag",
      "section s",
      "au x",
      "au se",
      "match Score",
      "Th read",
      "whi le",
      "omp_get _",
      ") *",
      "D ata",
      "f rom",
      "m in",
      "m iss",
      "n E",
      "p h",
      "u ce",
      "u ct",
      "z _block_size",
      "} ;",
      "ar it",
      "var s",
      "ch ild",
      "en er",
      "re f",
      "def ault",
      "str uct",
      "num ber",
      "num_ vars",
      "ri te",
      "il arit",
      "im e",
      "ilarit y",
      "- %",
      "4 2000",
      "5 33",
      "D i",
      "E nd",
      "P os",
      "_ set",
      "_ num_",
      "a ble",
      "a nd",
      "c ap",
      "c ause",
      "n e",
      "n am",
      "o p",
      "p counter",
      "t ime",
      "u le",
      "ma y",
      "-- ;",
      "al loc",
      "er ror",
      "on al",
      "add _M",
      "sim ilarity",
      "/* --------------------------------",
      "max Pos",
      "max _num_",
      "-------------------------------- ----",
      ".. .",
      "sched ule",
      "diag onal",
      "numNodes 2",
      "thread_ num",
      "initial ize",
      "packag es",
      "omp_get_ thread_num",
      "add_M ult",
      "/*-------------------------------- ------------------------------------",
      "max_num_ blocks",
      ") /",
      "4 8",
      "9 11",
      ": :",
      "C alc",
      "M iss",
      "O N",
      "] *",
      "a ck",
      "d y",
      "e len",
      "f t",
      "f elen",
      "g ener",
      "j b",
      "k b",
      "m o",
      "m y",
      "n prod",
      "p s",
      "p sum",
      "u p",
      "in cr",
      "ar t",
      "om ic",
      "pr ed",
      "le ft",
      "-- ){",
      "st _lock",
      "ag _t",
      "lo w",
      "se g",
      "en ce",
      "re s",
      "at ion",
      "at omic",
      "er ence",
      "loc al",
      "val ue",
      "200 00",
      "con sum",
      "ir st",
      "fl ag_t",
      "barrier_ wait",
      "no t",
      "prod uce",
      "sa felen",
      "Di ag",
      "ne st_lock",
      "nam ic",
      "Calc ul",
      "dy namic",
      "gener ate",
      "my barrier",
      "incr _",
      "( *",
      "1 19",
      "1 197",
      "4 7",
      "5 99",
      "5 81",
      "5 83",
      "5 49",
      "5 47",
      "6 61",
      "6 25",
      "6 27",
      "6 29",
      "7 5",
      "8 65",
      "8 63",
      "8 85",
      "8 89",
      "8 61",
      "8 67",
      "8 69",
      "8 87",
      "9 19",
      "9 15",
      "9 13",
      "9 65",
      "9 63",
      "9 89",
      "9 67",
      "9 69",
      "9 71",
      "9 37",
      "9 39",
      "9 17",
      "9 21",
      "9 73",
      "< <",
      "A b",
      "D one",
      "E r",
      "G A",
      "G et",
      "R e",
      "T T",
      "W rite",
      "] @",
      "_ nest_lock",
      "a b",
      "a i",
      "a j",
      "e v",
      "f 0",
      "g er",
      "i 2",
      "i x",
      "i able",
      "j 2",
      "k 2",
      "l d",
      "n thread",
      "n ste",
      "p y",
      "s z",
      "t y",
      "t ou",
      "t ing",
      "u sing",
      "x 1",
      "x py",
      "ma tr",
      "or ting",
      "st art",
      "lo op",
      "++ ,",
      "it h",
      "(\" \\",
      "12 55",
      "12 57",
      "12 33",
      "12 25",
      "12 27",
      "12 29",
      "12 81",
      "12 83",
      "12 31",
      "12 23",
      "12 49",
      "19 55",
      "19 57",
      "19 85",
      "19 61",
      "19 33",
      "19 25",
      "19 27",
      "19 29",
      "19 81",
      "19 83",
      "19 31",
      "19 35",
      "19 87",
      "re d",
      "re mo",
      "15 65",
      "15 63",
      "15 89",
      "15 61",
      "15 67",
      "15 69",
      "15 71",
      "15 35",
      "15 37",
      "15 39",
      "15 87",
      "16 19",
      "16 15",
      "16 13",
      "16 65",
      "16 67",
      "16 69",
      "16 71",
      "16 39",
      "16 23",
      "16 17",
      "16 21",
      "16 73",
      "16 75",
      "num Thread",
      "13 33",
      "13 27",
      "13 29",
      "13 31",
      "13 11",
      "13 35",
      "13 37",
      "tr ig",
      "() .",
      "99 1",
      "99 3",
      "99 5",
      "99 7",
      "num_ sz",
      "out Len",
      "65 1",
      "65 3",
      "65 5",
      "65 7",
      "65 9",
      "un ction",
      "18 0",
      "18 99",
      "18 81",
      "18 83",
      "200 3",
      "200 5",
      "200 7",
      "200 9",
      "ul ing",
      "20 25",
      "20 11",
      "55 1",
      "55 3",
      "55 5",
      "55 7",
      "63 1",
      "63 3",
      "63 5",
      "52 5",
      "52 9",
      "57 3",
      "57 5",
      "57 7",
      "57 9",
      "85 9",
      "89 1",
      "89 3",
      "89 5",
      "]!= -",
      "60 1",
      "60 3",
      "60 5",
      "60 7",
      "60 9",
      "ment s",
      "190 1",
      "190 3",
      "190 5",
      "190 7",
      "190 9",
      "164 1",
      "164 3",
      "164 5",
      "164 7",
      "164 9",
      "130 1",
      "130 3",
      "130 5",
      "130 7",
      "130 9",
      "con struct",
      "94 1",
      "94 3",
      "94 5",
      "94 7",
      "pe def",
      "120 1",
      "120 3",
      "120 5",
      "120 7",
      "159 1",
      "159 3",
      "159 5",
      "159 7",
      "187 3",
      "187 5",
      "187 7",
      "187 9",
      "match Miss",
      "Th is",
      "no wait",
      "125 1",
      "125 3",
      "125 9",
      "127 5",
      "127 7",
      "127 9",
      "195 1",
      "195 3",
      "195 9",
      "197 7",
      "197 9",
      "154 1",
      "154 3",
      "154 5",
      "element s",
      "sched uling",
      "sa xpy",
      "miss ing",
      "nE le",
      "ph ase",
      "ref erence",
      "alloc ate",
      "... \\",
      "seg ments",
      "119 9",
      "Ab orting",
      "Er ror",
      "Write _set",
      "ev en",
      "nste ps",
      "ty pedef",
      "tou ched",
      "matr ix",
      "numThread s",
      "trig ger",
      "matchMiss matchScore",
      "( !",
      ") )",
      "5 31",
      "7 0",
      "A N",
      "A X",
      "A lloc",
      "C on",
      "D e",
      "D _M",
      "E lement",
      "F unction",
      "I n",
      "L L",
      "N U",
      "N um",
      "N ON",
      "P r",
      "P ur",
      "R AN",
      "U n",
      "] -=",
      "a n",
      "a ch",
      "b oun",
      "c il",
      "f irst",
      "g n",
      "g r",
      "g ap",
      "h a",
      "i 1",
      "i se",
      "j 1",
      "k 1",
      "l t",
      "l im",
      "n con",
      "n Diag",
      "n cil",
      "o se",
      "p os",
      "p ose",
      "r 1",
      "s ter",
      "t ter",
      "v er",
      "w e",
      "w or",
      "w rite",
      "w ith",
      "in al",
      "in sert",
      "ma ster",
      "pr e",
      "le tter",
      "or ig",
      "var iable",
      "it ion",
      "]= ((",
      "par ent",
      "si gn",
      "re su",
      "ine s",
      "str ing",
      "tr ibute",
      "ra ise",
      "un sign",
      "thread private",
      "10 48",
      "ul ation",
      "52 3",
      "52 7",
      "base d",
      "con st",
      "con tribute",
      "pro gr",
      "race s",
      "pair s",
      "thread_ lim",
      "calc ulation",
      "ste ncil",
      "nE lement",
      "ref ine",
      "similarity Score",
      "low er",
      "value s",
      "Calcul ate",
      "incr_ b",
      "remo ve",
      "Alloc ates",
      "D_M AX",
      "NU LL",
      "Num ber",
      "NON E",
      "Pr o",
      "Pur pose",
      "RAN D_MAX",
      "Un iv",
      "boun d",
      "gap Score",
      "ncon s",
      "pos ition",
      "wor k",
      "orig inal",
      "resu lt",
      "unsign ed",
      "contribute d",
      "progr am",
      "thread_lim it",
      "stencil _",
      "' ,",
      "' ←",
      "' ↑",
      "( %",
      "( +",
      "( -",
      ") :",
      "* ));",
      "1 4",
      "2 l",
      "4 0",
      "5 6",
      "6 2",
      "6 6",
      "9 23",
      "> -",
      "A G",
      "A L",
      "A TT",
      "B U",
      "B e",
      "B ool",
      "C A",
      "C h",
      "C TT",
      "D E",
      "D I",
      "E F",
      "F ib",
      "F irst",
      "G u",
      "G ener",
      "H el",
      "L EF",
      "M at",
      "M ult",
      "R a",
      "R i",
      "S t",
      "S ize",
      "T H",
      "T ask",
      "U P",
      "Y i",
      "] <=",
      "_ input",
      "_ from",
      "_ Bool",
      "a c",
      "a f",
      "a ng",
      "a ccess",
      "b al",
      "b ack",
      "c omp",
      "c re",
      "c alloc",
      "d ri",
      "d uce",
      "f ines",
      "i st",
      "k e",
      "l ld",
      "o l",
      "p er",
      "r d",
      "r os",
      "s core",
      "s rand",
      "t s",
      "u se",
      "u ction",
      "v el",
      "w o",
      "w il",
      "z i",
      "{ }",
      "ma th",
      "de cess",
      "de red",
      "de allocate",
      "le vel",
      "or ag",
      "or dered",
      "st op",
      "st orag",
      "lo ad",
      "lo bal",
      "ou ld",
      "++ ]",
      "cl ause",
      "al low",
      "ur e",
      "se ed",
      "it ial",
      "ch ang",
      "omp_ set",
      "100 1",
      "as s",
      "as ing",
      "en s",
      "// #",
      "re ct",
      "ad _set",
      "ze ros",
      "th rd",
      "tr ack",
      "== =",
      "num_ refine",
      "sh ould",
      "ri x",
      "20 48",
      "the re",
      "max im",
      "pro te",
      "** )",
      "barrier_ init",
      "barrier_ destroy",
      "barrier_ start",
      "barrier_ stop",
      "No te",
      "no w",
      "es ted",
      "calc First",
      "packag e",
      "miss matchScore",
      "ph ab",
      "ON AL",
      "consum e",
      "consum ed",
      "produce d",
      "Diag Element",
      "Calcul ates",
      "incr_ a",
      "GA ATT",
      "GA CTT",
      "Re ad_set",
      "red uction",
      "Con sum",
      "De fines",
      "In itial",
      "an ts",
      "first private",
      "ha ve",
      "with in",
      "pre decess",
      "Pro duce",
      "stencil_ calc",
      "'← '",
      "'↑ '",
      "(+ :",
      "2l f",
      "AG ONAL",
      "BU G",
      "Be cause",
      "Ch ild",
      "DE BUG",
      "DI AGONAL",
      "Gener ates",
      "Hel per",
      "LEF T",
      "Mat rix",
      "Ra ce",
      "Ri ce",
      "Yi zi",
      "_from _input",
      "af ter",
      "back track",
      "cre asing",
      "dri ver",
      "wil l",
      "storag e",
      "load _from_input",
      "chang e",
      "maxim um",
      "calcFirst DiagElement",
      "phab et",
      "GAATT CA",
      "predecess or",
      "Helper s",
      "\" <<",
      "& &",
      ") -",
      ") .",
      ") \\",
      ") ++;",
      ") =%",
      "0 f",
      "2 6",
      "3 4",
      "9 6",
      "9 7",
      "; }",
      "> =",
      "A l",
      "A n",
      "A ach",
      "A TH",
      "C l",
      "C ol",
      "D el",
      "E x",
      "G en",
      "G lobal",
      "J o",
      "L ines",
      "M _",
      "P I",
      "P re",
      "P ATH",
      "R W",
      "R and",
      "S i",
      "S te",
      "S um",
      "S tr",
      "S im",
      "S ig",
      "T ime",
      "T wo",
      "U p",
      "V ar",
      "W e",
      "W u",
      "W en",
      "W ith",
      "[ *",
      "[ ]",
      "] \\",
      "] };",
      "_ c",
      "_ l",
      "_ n",
      "_ s",
      "_ pro",
      "a w",
      "a in",
      "a il",
      "a ke",
      "b l",
      "b t",
      "b ut",
      "c i",
      "c out",
      "c assert",
      "c au",
      "d at",
      "d ate",
      "d ates",
      "e g",
      "e sh",
      "e able",
      "e ach",
      "f printf",
      "f ault",
      "f erence",
      "f unction",
      "f ail",
      "g g",
      "g one",
      "g lobal",
      "g eable",
      "i p",
      "i std",
      "i re",
      "i ke",
      "l y",
